Tekla Open API Reference for Tekla Structures 2025
PointCloud.UseAutoCreatedBasePoint Property
 Gets or sets a value indicating whether an auto-created base point should be used. If set to true, LocationBy value is ignored.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool UseAutoCreatedBasePoint { get; set; }
Public Property UseAutoCreatedBasePoint As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
PointCloud Class
Tekla.Structures.Model Namespace